src/CFD/ConvergenceStudy-x2/pipe_validation_160/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    upperWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          200;
        startFace       4588;
    }
    lowerWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          40;
        startFace       4788;
    }
    heatedWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          160;
        startFace       4828;
    }
    inlet
    {
        type            patch;
        nFaces          12;
        startFace       4988;
    }
    outlet
    {
        type            patch;
        nFaces          12;
        startFace       5000;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          4800;
        startFace       5012;
    }
)

// ************************************************************************* //
